<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest LibreOffice. Set RELEASE to either 'Latest' or 'Previous'.

LibreOffice Previous is the stable version that has undergone more testing (over a longer time). It is usually recommended for more conservative use.
LibreOffice Latest is the stable version with the most recent features. Users interested in taking advantage of our most innovative features should download and use our Latest version.
The architecture (ARCH) can be 'x86_64' or 'aarch64'
</string>
	<key>Identifier</key>
	<string>com.github.prop-office.autopkg-recipes.intel.download.LibreOffice</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LibreOffice</string>
		<key>RELEASE</key>
		<string>Latest</string>
		<key>ARCH</key>
		<string>x86_64</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 YaBrowser/24.4.0.0 Safari/537.36</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Try to parse the the 'Latest' or 'Previous' version from current release notes</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>LibreOffice (?P&lt;version&gt;\d+\.\d+(\.\d+)?) \(\d{4}-\d{2}-\d{2}\) - %RELEASE% Release</string>
				<key>url</key>
				<string>https://www.libreoffice.org/download/release-notes/</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>
				The current (late June 2021) dmg download URL at
				https://www.libreoffice.org/download/download/?type=mac-x86_64
				takes us to a JavaScript-heavy page that eventually redirects to
				the download, but the download is at a predictable URL once we
				know the version. So we just assemble that URL.
			</string>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.libreoffice.org/donate/dl/mac-%ARCH%/%version%/mac/%ARCH%/en/LibreOffice_%version%_MacOS_%ARCH%.dmg</string>
				<key>filename</key>
				<string>%NAME%-%ARCH%-%version%.dmg</string>
                <key>request_headers</key>
                    <dict>
                        <key>User-Agent</key>
                        <string>%USER_AGENT%</string>
                    </dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/LibreOffice.app</string>
				<key>requirement</key>
				<string>(identifier "org.libreoffice.script.LibreOffice" or identifier "org.libreoffice.script") and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7P5S3ZLCN7"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
	</array>
</dict>
</plist>