<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of DEPNotify and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.prop-office.autopkg-recipes.pkg.DEPNotify</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DEPNotify</string>
        <key>PACKAGES</key>
        <string>/Users/admin/Library/AutoPkg/Packages</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.prop-office.autopkg-recipes.download.DEPNotify</string>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>unpack</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/Tableau Desktop.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
    </array>
</dict>
</plist>
