<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of DBeaver Community Edition.</string>
    <key>Identifier</key>
    <string>com.github.prop-office.autopkg-recipes.applesilicon.download.DBeaverCE</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DBeaver</string>
        
<!--SELECT YOUR OS VERSION AND USE IT IN YOUR OVERRIDE
	"installer" for MAC OS X Pkg installer
	"macos-x86_64" for macOS x86_64 DMG
	"macos-aarch64" for macOS arm64 M1 DMG
-->
		<key>os</key>
		<string>macos-x86_64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
    	<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
        	<key>Arguments</key>
        	<dict>
          		<key>github_repo</key>
          		<string>dbeaver/dbeaver</string>
          		<key>asset_regex</key>
          		<string>(dbeaver-ce-[0-9]+.[0-9]+.[0-9]+[-_]+%os%.[^"]*)</string>
        	</dict>
      	</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%NAME%*.app</string>
                <key>requirement</key>
                <string>identifier "org.jkiss.dbeaver.core.product" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "42B6MDKMW8"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
