<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Docker Desktop and creates a package. See the download recipe description for information about using the PLATFORM_ARCH input variable to download the Intel/Apple Silicon version of Docker.</string>
	<key>Identifier</key>
	<string>com.github.prop-office.autopkg-recipes.intel.pkg.DockerDesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Docker</string>
        <key>PACKAGES</key>
        <string>/Users/admin/Library/AutoPkg/Packages</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.prop-office.autopkg-recipes.intel.download.DockerDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%PLATFORM_ARCH%-%version%.pkg</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%PLATFORM_ARCH%-%version%.pkg</string>
                <key>destination_path</key>
                <string>%PACKAGES%/%NAME%-%PLATFORM_ARCH%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%PACKAGES%/%NAME%-%PLATFORM_ARCH%-%version%.pkg</string>
                <key>destination_path</key>
                <string>%PACKAGES%/%NAME%-%PLATFORM_ARCH%.pkg</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
