<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Yandex Disk disk image.</string>
    <key>Identifier</key>
    <string>com.github.prop-office.autopkg-recipes.download.yandexdisk</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>YandexDisk</string>
        <key>DOWNLOAD_URL</key>
        <string>https://disk.yandex.ru/download/Yandex.Disk.dmg/?instant=1</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.0 Safari/605.1.15</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>request_headers</key>
                    <dict>
                        <key>User-Agent</key>
                        <string>%USER_AGENT%</string>
                    </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Yandex.Disk.2.app</string>
                <key>strict_verification</key>
                <false/>
                <key>requirement</key>
                <string>identifier "ru.yandex.desktop.disk2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "477EAT77S3"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
