<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Viber</string>
	<key>Identifier</key>
	<string>com.github.prop-office.autopkg-recipes.download.viber</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Viber</string>
		<key>DOWNLOAD_URL</key>
		<string>https://download.viber.com/desktop/mac/Viber.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
        		<string>%DOWNLOAD_URL%</string>
        		<key>filename</key>
        		<string>%NAME%.dmg</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Viber.app</string>
                <key>strict_verification</key>
                <false/>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.viber.osx" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "86ZW9CB9ZQ")</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>